In [33]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [34]:
GDP_csv = pd.read_csv("GDP.clean")
GDP_df = pd.DataFrame(GDP_csv)

home_ownership_csv = pd.read_csv("Homeownership_ACS.clean")
home_ownership_df = pd.DataFrame(home_ownership_csv)

In [35]:
del GDP_df['Unnamed: 0']
GDP_df.head()

        County        GDP
0  Autauga, AL  1539406.0
1  Baldwin, AL  6436107.0
2  Barbour, AL   743779.0
3     Bibb, AL   322307.0
4   Blount, AL   819608.0

In [36]:
del home_ownership_df['Unnamed: 0']
home_ownership_df.head()

    HOR       County
0  73.3  Autauga, AL
1  72.9  Baldwin, AL
2  62.5  Barbour, AL
3  75.4     Bibb, AL
4  78.5   Blount, AL

In [37]:
sample_home_ownership = home_ownership_df.sample(n=650)
sample_home_ownership = sample_home_ownership.reset_index(drop=True)
sample_home_ownership.head()

    HOR           County
0  71.9          Lee, VA
1  76.6   Rio Arriba, NM
2  78.3         Bond, IL
3  69.3          Nye, NV
4  67.8  Schenectady, NY

In [38]:
GDP_analysis = sample_home_ownership.merge(GDP_df, on="County")
GDP_analysis.head()

    HOR           County        GDP
0  71.9          Lee, VA   407886.0
1  76.6   Rio Arriba, NM   636882.0
2  78.3         Bond, IL   480117.0
3  69.3          Nye, NV  1312530.0
4  67.8  Schenectady, NY  7816128.0